export const mockQuranData = [
    {
      surahNumber: 1,
      name: 'الفاتحة',
      ayat: [
        'بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ',
        'الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ',
        'الرَّحْمَٰنِ الرَّحِيمِ',
        'مَالِكِ يَوْمِ الدِّينِ',
        'إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ',
        'اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ',
        'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ',
      ],
    },
    {
      surahNumber: 2,
      name: 'البقرة',
      ayat: [
        'الم',
        'ذَٰلِكَ الْكِتَابُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًى لِّلْمُتَّقِينَ',
        'الَّذينَ يُؤمِنونَ بِالغَيبِ وَيُقيمونَ الصَّلوٰةَ وَمِمّا رَزَقنٰهُم يُنفِقونَ',
        'وَالَّذينَ يُؤمِنونَ بِما أُنزِلَ إِلَيكَ وَما أُنزِلَ مِن قَبلِكَ وَبِالـٔاخِرَةِ هُم يوقِنونَ',
        "أُولٰئِكَ عَلىٰ هُدًى مِن رَبِّهِم وَأُولٰئِكَ هُمُ المُفلِحونَ",
        "إِنَّ الَّذينَ كَفَروا سَواءٌ عَلَيهِم ءَأَنذَرتَهُم أَم لَم تُنذِرهُم لا يُؤمِنونَ",
        "خَتَمَ اللَّهُ عَلىٰ قُلوبِهِم وَعَلىٰ سَمعِهِم وَعَلىٰ أَبصٰرِهِم غِشٰوَةٌ وَلَهُم عَذابٌ عَظيمٌ",
        "وَمِنَ النّاسِ مَن يَقولُ ءامَنّا بِاللَّهِ وَبِاليَومِ الـٔاخِرِ وَما هُم بِمُؤمِنينَ",
        "يُخٰدِعونَ اللَّهَ وَالَّذينَ ءامَنوا وَما يَخدَعونَ إِلّا أَنفُسَهُم وَما يَشعُرونَ"
      ],
    },

    
    // Add more surahs as needed for testing
  ];
  